# Завдання: 1) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінної new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює половині значення, у протилежному випадку - протиположне
#     значенню число

value = int(input("Завдання №1. Введіть число : "))
new_value = value / 2 if value < 100 else -1*value
print(new_value)

#Завдання: 2) У вас є змінна величина, тип - int. Написати тернарний оператор для змінної new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює 1, у протилежному випадку - 0

value = int(input("Завдання №2. Введіть число: "))
new_value = value == 1 if value < 100 else value == 0
print(int(new_value))

# Завдання: 3) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінного new_value за таким правилом: якщо
#     значення менше 100, то new_value дорівнює True, у протилежному випадку - False

value = int(input("Завдання №3. Введіть число: "))
new_value = value == 1 if value < 100 else value == 0
print(new_value)

#Завдання: 4) У вас є змінна my_str, тип - str. Якщо її довше менше 5, то допишіть в кінці строки її ж.
#     Приклад: було - "qwer", стало - "qwerqwer". Якщо довжина не менше 5, то залишити строку як є.

my_str = str(input("Завдання №4. Введіть строку: "))
my_str = my_str*2 if len(my_str) < 5 else my_str
print(my_str)

#Завдання:  5) У вас є змінна my_str, тип - str. Якщо її довжина менше 5, то допишіть в кінці рядка перевернуту її ж.
#     Приклад: було - "qwer", стало - "qwerrewq". Якщо довжина не менше 5, то залишити строку як є.

my_str = str(input("Завдання №5. Введіть строку: "))
my_str = my_str + my_str[::-1] if len(my_str) < 5 else my_str
print(my_str)

########################################################

# 6) Допрацювати завдання з калькулятором, щоб в кінці вичислення у користувача запитало, чи потрібен  калькулятор ще.
#   Якщо так, то запустити програму з початку.

#  Завдання виконано у файлі lesson_3.py