# 1. Дано рядок.
#      a. виведіть третій символ цього рядка.
str_1 = str("Привіт як справи?")
print(str_1[2:3:])

#      b. виведіть передостанній символ цього рядка.
str_1 = str("Привіт як справи?")
print(str_1[-2::2])

#      c. виведіть перші п'ять символів цього рядка.
str_1 = str("Привіт як справи?")
print(str_1[:5:])

#      d. виведіть весь рядок, крім двох останніх символів.
str_1 = str("Привіт як справи?")
print(str_1[:-2:])

#      e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0,
#      тому символи виводяться починаючи) з першого).
str_1 = str("Привіт як справи?")
print(str_1[1::2])

#      f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
str_1 = str("Привіт як справи?")
print(str_1[2::2])

#      g. виведіть усі символи у зворотному порядку.
str_1 = str("Привіт як справи?")
print(str_1[::-1])

#      h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
str_1 = str("Привіт як справи?")
print(str_1[::-2])

#      i. виведіть довжину цього рядка.
str_1 = str("Привіт як справи?")
print(len(str_1))

# 2. Дано рядок, що складається зі слів, розділених пробілами. Визначте, скільки у ній слів. Використовуйте для вирішення
# завдання функцію `count`
str_1 = str("Привіт як справи?")
word_count = str_1.count(" ") + 1
print(word_count)

# 3. Користувач вводить окремо рядок `s` та один символ `ch`. Необхідно здійснити пошук у рядку `s` всіх символів `ch`.
# Для вирішення можна використовувати тільки функцію `find` (rfind), оператори `if` та `for` (while).

# Рішення знаходиться у файлі  lessen_5.3.py

# 4. Дано рядок. Замініть у цьому рядку всі появи літери `h` на літеру `H`, крім першого та останнього входження.
def replace_h(string):
    if string.count('h') < 2:
        return string
    first_h_index = string.find('h')
    last_h_index = string.rfind('h')
    modified_string = string[:first_h_index + 1] + string[first_h_index + 1:last_h_index].replace('h', 'H') + string[last_h_index:]
    return modified_string
original_string = "hello world, hello world hello world hello world"
modified_string = replace_h(original_string)
print(modified_string)